Tekla Open API Reference for Tekla Structures 2025
MaterialName Properties
The MaterialName type exposes the following members.
Properties
Name | Description
Name
 The material item name.
Top
See Also
Reference
MaterialName Class
Tekla.Structures.Catalogs Namespace